# GetVertNum

## Description
Function GetVertNum returns the number of vertices of the referenced polygon or polyline object.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION GetVertNum(PolyHd : HANDLE) : INTEGER;
```

```python

def vs.GetVertNum(PolyHd):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|PolyHd|HANDLE|Handle to polygon.|

## Version
Availability: from MiniCAD
## Category
* Objects - Polys